
# Преподаватель ведёт занятия с 10:30 до 12:00, с 13:40 до 15:00, с 18:00 до 19:30. В университет он приходит в 10 утра,
# а уходит - в 20 часов. Время в университете, свободное от занятий, он посвящает консультированию студентов.
# Напишите программу, которая помогла бы студентам подстроиться под свободное время преподавателя: пусть они вводят
# желаемое время (сначала одно число — часы (hour), затем второе — минуты (minute)), а программа показывает,
# свободен преподаватель в это время или нет (выводит на экран "Преподаватель свободен." или "Преподаватель занят.",
# соответственно). Для проверки используйте hour = 18 и minute = 47

hour = 18
minute = 47