import pandas as pd

data = {
    'Name': ['Иван Мурзин', 'Александр Сафонов', 'Вячеслав Трофимов', 'Дима Яковлев', 'Юлия Сазонова', 'Петр Александров',
             'Данил Журавлёв', 'Влад Усов', 'Руслан Иванов', 'Яна Спиридонова', 'Оксана Новикова', 'Серега Сафонов',
             'Петр Пушкин', 'Павел Ефимов', 'Кристина Хамитова'],
    'Avg_Grade': [90, 85, 92, 88, 80, 86, 85, 90, 96, 80, 92, 88, 90, 85, 92],
    'Exam_Grade': [11, 12, 11, 12, 10, 12, 11, 12, 12, 10, 12, 11, 12, 10, 12]
}

df = pd.DataFrame(data)
print(df)
