'''
Написати програму з використанням рекурсії. Програма повинна приймати 3 консолі ціле натуральне число. Далі, використовуючи функцію,
в якій реалiзований механізм рекурсії, програма вiднiмає вiд заданого числа одиницю і виводити у консоль поточне число.
Програма повинна припинити роботу, коли число дорівнюватиме нулю.
'''

def function(number):
    if number > 0:
        number -= 1
        print(number)
        function(number)
    else:
        return

number = int(input("Введіть число: "))

function(number)